Revit 2026 API

# ElectricalSystemTrueLoadPhaseC Property

---

The TrueLoadPhaseC value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueLoadPhaseC { get; }
```
```vb
Public ReadOnly Property TrueLoadPhaseC As Double
	Get
```
```cpp
public:
property double TrueLoadPhaseC {
	double get ();
}
```
```fsharp
member TrueLoadPhaseC : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueLoadPhaseC value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace